xfire-aegis/src/test/org/codehaus/xfire/aegis/type/xml/test.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <e:echoInt xmlns:e="urn:PrimitiveService">
    <e:in0>1</e:in0>
  </e:echoInt>
 </env:Body>
</env:Envelope>